upstream/OpenFOAM-v2606/tutorials/lagrangian/kinematicParcelFoam/pitzDailyWithSprinklers/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     kinematicParcelFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         13;

deltaT          0.005;

writeControl    adjustable;

writeInterval   0.25;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.9;

regionFaMaxCo   1;

maxDeltaT       0.1;


// ************************************************************************* //
